sdaiCreateComplexInstanceBN(Sdai_instS*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**)
\details
Creates a complex instance with the specified name.
\param model      [in] A model to create the complex instance within.
\param nameNumber [in] A number of instances included in the complex instance.
\param nameVector [in] A raw pointer to the array of names of instances included in the complex instance.
\returns A created complex application instance.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NVLD - Entity definition invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiString instance_names[] = {
"geometric_representation_context",
"global_uncertainty_assigned_context",
"global_unit_assigned_context",
"representation_context"
};
SdaiInstance complex_instance = sdaiCreateComplexInstanceBN(model, 4, instance_names);